---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.EnergyAnalysisFailures.NoSpaceBoundingElementsWarn
source: html/33760464-b5c4-bf56-3c55-e6b3dacef517.htm
---
# Autodesk.Revit.DB.BuiltInFailures.EnergyAnalysisFailures.NoSpaceBoundingElementsWarn Property

Can't create any energy analysis surfaces. There are no Space bounding elements defined in the current phase. Please check the Project Information settings.

## Syntax (C#)
```csharp
public static FailureDefinitionId NoSpaceBoundingElementsWarn { get; }
```